<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('news')->insert([
            [
                'title' => 'Grok AI เปิดตัวฟีเจอร์ "Companions" พร้อมโหมด NSFW',
                'image' => 'https://static.toiimg.com/thumb/msid-123507219,imgsize-249247,width-800,height-600,resizemode-75/123507219.jpg',
                'content' => 'บทความนี้เกี่ยวกับ Grok ซึ่งเป็น AI ของ xAI ที่มีเจ้าของคือ Elon Musk ได้เปิดตัวฟีเจอร์ใหม่ชื่อ "Companions" สำหรับผู้ใช้ SuperGrok ซึ่งเป็นแพ็กเกจพรีเมียมราคา 300 ดอลลาร์ต่อเดือน ฟีเจอร์นี้เป็นตัวละคร AI แบบแอนิเมชันที่สามารถตอบสนองแบบเรียลไทม์ได้ ปัจจุบันมีตัวละครให้เลือก 2 ตัวคือ Ani และ Bad Rudy โดยสิ่งที่ทำให้เกิดกระแสวิจารณ์คือ Ani มาพร้อมกับโหมด NSFW ที่ปลดล็อกบทสนทนาเชิงยั่วยวน นักจิตวิทยาเตือนว่า AI ลักษณะนี้อาจทำให้ผู้ใช้มีปัญหาความเหงา การพึ่งพาอารมณ์กับโลกเสมือน และความยากในการสร้างความสัมพันธ์จริงในอนาคต

การเปิดตัวฟีเจอร์นี้เกิดขึ้นในช่วงที่กระแส "AI Companion" หรือ "AI แฟนเสมือน" กำลังมาแรง ซึ่งคาดว่าตลาดนี้จะมีมูลค่าสูงถึง 175 พันล้านดอลลาร์ในอีก 10 ปีข้างหน้า ฟีเจอร์นี้ยังเปิดทางให้มีการใช้งานใน Tesla และอุปกรณ์อื่นๆ ในอนาคต ปัจจุบันฟีเจอร์ Companions ให้บริการเฉพาะบนแอปพลิเคชัน iOS เท่านั้น แต่คาดว่าจะขยายไปยัง Android และเวอร์ชันเว็บในอนาคตเพื่อรองรับผู้ใช้ที่เพิ่มขึ้นอย่างรวดเร็ว',
                'source_url' => 'https://siamblockchain.com/2025/07/15/grok-ai-companion-nsfw-viral-elon-musk-ai-ios/',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'title' => 'ประธานาธิบดีทรัมป์ต้องการให้ Elon Musk และธุรกิจทั้งหมดในสหรัฐฯ เติบโตอย่างที่ไม่เคยมีมาก่อน',
                'image' => 'https://static.toiimg.com/thumb/msid-123493338,imgsize-249247,width-800,height-600,resizemode-75/123493338.jpg',
                'content' => 'บทความนี้เกี่ยวกับโดนัลด์ ทรัมป์ ที่ย้ำว่าจะไม่ตัดเงินทุนสำหรับธุรกิจของ Elon Musk โดยระบุว่าเขาต้องการให้ธุรกิจเหล่านี้เติบโตในสหรัฐอเมริกา บทความจาก Siam Blockchain ลงวันที่ 24 กรกฎาคม 2025 ระบุว่า ทรัมป์ได้ปฏิเสธข่าวลือที่ว่าเขาจะยุติการสนับสนุนจากรัฐบาลกลางสำหรับบริษัทของ Musk โดยโพสต์ข้อความบนโซเชียลมีเดียว่าเขาต้องการให้ Elon และธุรกิจทั้งหมดในประเทศประสบความสำเร็จ การแถลงการณ์นี้มีขึ้นหลังจากที่ Musk เตือนนักลงทุน Tesla ว่าบริษัทอาจเผชิญกับ "ไตรมาสที่ยากลำบาก" หากรัฐบาลลดการสนับสนุนผู้ผลิตรถยนต์ไฟฟ้า

บทความยังกล่าวถึงความสัมพันธ์ที่ซับซ้อนระหว่างทรัมป์และ Musk ซึ่งเคยตกเป็นเป้าของการจับตามอง ก่อนหน้านี้ Musk เคยให้การสนับสนุนทางการเงินแก่การหาเสียงของทรัมป์และมีส่วนร่วมในการผลักดันให้มีการลดงบประมาณของรัฐบาลและจำนวนข้าราชการ อย่างไรก็ตาม ความสัมพันธ์ของทั้งคู่ตึงเครียดขึ้นหลังจากที่ Musk ลาออกจากตำแหน่งในรัฐบาลในเดือนพฤษภาคมเพื่อมุ่งเน้นธุรกิจของตัวเอง และวิพากษ์วิจารณ์ร่างกฎหมายภาษีและงบประมาณของทรัมป์ในที่สาธารณะ มีข่าวลือว่าทรัมป์อาจตอบโต้ด้วยการยกเลิกสัญญารัฐบาลขนาดใหญ่กับบริษัทของ Musk ทั้ง Tesla และ SpaceX

แม้จะมีปัญหาในอดีต แต่คำแถลงล่าสุดของทรัมป์ดูเหมือนจะเป็นความพยายามที่จะคืนดีและส่งสัญญาณถึงความปรารถนาที่จะเห็นบริษัทเทคโนโลยีของ Musk และธุรกิจอเมริกันทั้งหมดเติบโตและแข่งขันในเวทีระดับโลกต่อไป บทความยังระบุด้วยว่าอุตสาหกรรมรถยนต์ไฟฟ้ากำลังเผชิญกับแรงกดดันจากการเปลี่ยนแปลงนโยบายของรัฐบาลและการแข่งขันที่รุนแรง ทำให้ทิศทางนโยบายในอีกไม่กี่เดือนข้างหน้ามีความสำคัญอย่างยิ่งสำหรับบริษัทอย่าง Tesla',
                'source_url' => 'https://siamblockchain.com/2025/07/24/president-trump-wants-elon-musk-and-all-us-businesses-to-thrive-like-never-before/',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 3
            [
                'title' => 'Elon Musk ยอมรับหนี้ 37 ล้านล้านดอลลาร์ และเชื่อว่า Bitcoin จะพุ่งขึ้น',
                'image' => 'https://static.toiimg.com/thumb/msid-123482243,imgsize-249247,width-800,height-600,resizemode-75/123482243.jpg',
                'content' => 'ในวันที่ 7 กรกฎาคม 2025 Elon Musk ได้ยืนยันข่าวลือเรื่องวิกฤตหนี้ของสหรัฐฯ ที่พุ่งสูงถึง 37 ล้านล้านดอลลาร์ และเชื่อว่าอาจเป็นปัจจัยที่ทำให้ราคา Bitcoin พุ่งสูงขึ้น เขายังได้ประกาศจัดตั้งพรรคการเมืองใหม่ชื่อ "America Party" เนื่องจากไม่เห็นด้วยกับนโยบายการขยายเพดานหนี้ของอดีตประธานาธิบดีโดนัลด์ ทรัมป์ ซึ่งเขามองว่าเป็นหนทางสู่ความหายนะ

มัสก์ได้โพสต์ข้อความบน X ว่า "นี่จะทำให้ประเทศล้มละลาย" และเมื่อมีผู้ใช้รายหนึ่งถามว่าพรรค America Party จะสนับสนุน Bitcoin หรือไม่ เขาก็ตอบว่า "เงิน Fiat (เงินทั่วไป) หมดหวัง ดังนั้น... ใช่" ซึ่งคำตอบนี้เพียงประโยคเดียวก็ทำให้ราคา Bitcoin ขยับขึ้นทันที แม้ว่าในช่วงสองปีที่ผ่านมามัสก์จะไม่ได้พูดถึง Bitcoin อย่างเปิดเผย แต่ Tesla บริษัทของเขาก็ยังคงถือครอง Bitcoin อยู่ประมาณ 10,000 BTC

นักวิเคราะห์หลายคนเชื่อว่าการขยายตัวทางการคลังครั้งใหญ่นี้จะเร่งให้ Bitcoin ซึ่งเป็น "ทองคำดิจิทัล" มีราคาพุ่งขึ้นอย่างรุนแรงหากเกิดภาวะเงินเฟ้อสูงและค่าเงินดอลลาร์อ่อนค่าลง นักลงทุนใน Wall Street และ Silicon Valley ก็เริ่มแสดงความกังวลต่อสถานการณ์หนี้ของสหรัฐฯ และความเสี่ยงทางการคลังที่เพิ่มขึ้นอย่างรวดเร็ว',
                'source_url' => 'https://siamblockchain.com/2025/07/07/elon-musk-accept-debt-37-millions-bitcoin-up/',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 4
            [
                'title' => 'xAI ของ Elon Musk ร่วมมือกับ Kalshi เพื่อนำ Grok สู่ตลาดพยากรณ์',
                'image' => 'https://static.toiimg.com/thumb/msid-123484737,imgsize-249247,width-800,height-600,resizemode-75/123484737.jpg',
                'content' => 'บทความนี้จาก Siam Blockchain รายงานว่า Elon Musk ได้นำแชทบอท AI ของบริษัท xAI ที่มีชื่อว่า "Grok" เข้าสู่ตลาดการพนัน โดยจับมือเป็นพันธมิตรกับ Kalshi ซึ่งเป็นแพลตฟอร์มตลาดพยากรณ์ที่ถูกต้องตามกฎหมายเพียงแห่งเดียวในสหรัฐอเมริกา

ความร่วมมือนี้มีเป้าหมายให้ Grok สามารถวิเคราะห์ข้อมูลข่าวสาร, ข้อมูลในอดีต และตัวชี้วัดทางเศรษฐกิจแบบเรียลไทม์ เพื่อช่วยสนับสนุนผู้ใช้งานบนแพลตฟอร์ม Kalshi ที่มีการวางเดิมพันกับผลลัพธ์ของเหตุการณ์ต่างๆ เช่น การตัดสินใจอัตราดอกเบี้ยของธนาคารกลางสหรัฐฯ หรือตัวเลขเงินเฟ้อรายเดือน ความสามารถของ Grok ในการสรุปข้อมูลที่ซับซ้อนอย่างรวดเร็วถือเป็นข้อได้เปรียบที่สำคัญสำหรับนักเทรด

บทความยังชี้ให้เห็นถึงความซับซ้อนในกลยุทธ์ของ Musk เนื่องจากก่อนหน้านี้ xAI และ X เพิ่งประกาศให้ Polymarket ซึ่งเป็นคู่แข่งของ Kalshi ที่ใช้คริปโตเป็นพื้นฐานและยังไม่ได้รับการกำกับดูแล เป็น "พันธมิตรตลาดพยากรณ์อย่างเป็นทางการ" การจับมือกับ Kalshi ในครั้งนี้จึงทำให้ตลาดพยากรณ์กลายเป็นสนามทดสอบสำหรับ Grok ภายใต้กรอบการกำกับดูแลที่แตกต่างกันสองรูปแบบ การประกาศความร่วมมือเกิดขึ้นหลังจากที่ Grok 4 เวอร์ชันล่าสุดได้เปิดตัวไปเมื่อต้นเดือนกรกฎาคม 2025 โดยมีการอัปเกรดความสามารถในการใช้เหตุผลและการดึงข้อมูล',
                'source_url' => 'https://siamblockchain.com/2025/07/25/elon-musks-xai-partners-with-kalshi-to-bring-grok-to-prediction-markets/',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 5
            [
                'title' => 'บอร์ด Tesla ง้อ Elon Musk ไฟเขียวหุ้นเกือบ 30,000 ล้านดอลลาร์',
                'image' => 'https://static.toiimg.com/thumb/msid-123407879,imgsize-249247,width-800,height-600,resizemode-75/123407879.jpg',
                'content' => 'บอร์ดบริหารของ Tesla ได้อนุมัติแพ็กเกจหุ้นใหม่มูลค่าเกือบ 30,000 ล้านดอลลาร์สหรัฐให้กับ Elon Musk เพื่อเป็นรางวัลชั่วคราวและจูงใจให้เขาดำรงตำแหน่งผู้นำต่อไปอีกอย่างน้อย 2 ปี เนื่องจากบริษัทกำลังเผชิญกับช่วงเปลี่ยนผ่านที่สำคัญจากธุรกิจรถยนต์ไฟฟ้าที่ยอดขายลดลงไปสู่ยุคของ Robotaxi และหุ่นยนต์ฮิวแมนนอยด์ นอกจากนี้ยังต้องการรั้งตัวเขาไว้ในฐานะ "แม่เหล็กขององค์กร" ที่ดึงดูดบุคลากรที่มีความสามารถเข้ามาทำงาน โดยเฉพาะในยุคที่การแข่งขันด้าน AI ทวีความรุนแรงขึ้น

แพ็กเกจหุ้นใหม่นี้รวมสิทธิในการซื้อหุ้นจำนวน 96 ล้านหุ้น ซึ่งมีเงื่อนไขว่า Musk จะต้องดำรงตำแหน่งผู้นำของบริษัทอย่างต่อเนื่องเป็นเวลา 2 ปี และถือหุ้นที่ได้รับไว้เป็นเวลา 5 ปี นับจากวันที่เริ่มต้น ข้อตกลงนี้ยังมีข้อกำหนดป้องกันการได้รับรางวัลซ้ำซ้อน หากศาลมีคำสั่งให้ฟื้นฟูแพ็กเกจค่าตอบแทนเดิมในปี 2018 ที่เคยถูกระงับไป

การตัดสินใจครั้งนี้เกิดขึ้นท่ามกลางความท้าทายหลายอย่างที่ Tesla กำลังเผชิญ ไม่ว่าจะเป็นยอดขายรถยนต์ที่ลดลง, กลุ่มผลิตภัณฑ์ที่เริ่มล้าสมัย, และการแข่งขันที่รุนแรงจากค่ายรถยนต์ไฟฟ้าของจีน รวมถึงผลกระทบต่อภาพลักษณ์ของแบรนด์จากท่าทีทางการเมืองของ Musk อย่างไรก็ตาม คณะกรรมการบริษัทยังคงเชื่อมั่นว่าเขาคือผู้นำที่เหมาะสมที่สุดในการนำพาบริษัทผ่านพ้นความท้าทายเหล่านี้ โดยนักวิเคราะห์บางรายมองว่าการจ่ายค่าตอบแทนครั้งนี้จะช่วยปลดล็อกความไม่แน่นอนและรับประกันว่า Musk จะยังคงเป็นซีอีโอของ Tesla ไปอีกหลายปี',
                'source_url' => 'https://www.thairath.co.th/money/tech_innovation/tech_companies/2874754',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 6
            [
                'title' => 'xAI ของ Elon Musk เปิดตัวโมเดล AI Grok 4',
                'image' => 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS-cZexbbzCkxrHMMM0pz0IOu6vHezO3_n8sQ&s',
                'content' => 'บทความนี้เกี่ยวกับบริษัทสตาร์ทอัพด้านปัญญาประดิษฐ์ xAI ของ Elon Musk ที่ได้เปิดตัวโมเดล AI ใหม่ชื่อ Grok 4 โดย Investing.com

Grok 4 เป็นโมเดล AI เวอร์ชันอัปเดตที่มีคุณสมบัติมัลติโมดัล การให้เหตุผลที่เร็วขึ้น อินเทอร์เฟซที่ได้รับการอัปเกรด และการสื่อสารด้วยเสียงที่ดีขึ้น การเปิดตัวได้จัดขึ้นในรูปแบบการถ่ายทอดสดเมื่อคืนวันพุธ และแม้จะเริ่มช้ากว่ากำหนดไปประมาณหนึ่งชั่วโมง แต่ก็มีการแสดงประสิทธิภาพของโมเดลใหม่ให้เห็น

xAI อ้างว่า Grok 4 มีอันดับสูงกว่าคู่แข่งอย่าง GPT-03 และ Gemini 2.5 pro ในเกณฑ์มาตรฐานหลัก และ Elon Musk ยังกล่าวอีกว่า Grok 4 "ดีกว่าระดับปริญญาเอกในทุกวิชา ไม่มีข้อยกเว้น" นอกจากนี้ บทความยังมีการแสดงรายการภาษาที่รองรับและเครื่องมือการลงทุนต่างๆ ที่มีอยู่ในเว็บไซต์ Investing.com เช่น ดัชนี หุ้น สกุลเงิน สินค้าโภคภัณฑ์ และอื่นๆ',
                'source_url' => 'https://th.investing.com/news/stock-market-news/article-402427',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 7
            [
                'title' => 'SpaceX ทดสอบจรวด Starship สำเร็จ',
                'image' => 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0m0nz3m1fkIAzLqizSnSFGOZGUNE3Cbl0UQ&s',
                'content' => 'บทความนี้รายงานข่าวความสำเร็จในการทดสอบยานอวกาศ Starship รุ่นล่าสุดของบริษัท SpaceX ซึ่งเป็นยานอวกาศที่ใหญ่ที่สุดและทรงพลังที่สุดในโลก โดยการทดสอบในครั้งนี้ถือเป็นความสำเร็จหลังจากที่การทดสอบ 3 ครั้งก่อนหน้านี้ประสบความล้มเหลว

จรวดได้ถูกปล่อยขึ้นจากฐานปล่อยในรัฐเท็กซัสและสามารถลงจอดในอ่าวเม็กซิโกได้อย่างสวยงาม แม้จะมีเหตุการณ์ที่ชิ้นส่วนเครื่องยนต์ระเบิดและแผ่นปิดจรวดติดไฟและแกว่งไปมาก็ตาม อีลอน มัสก์ ซีอีโอของ SpaceX ได้โพสต์แสดงความยินดีกับทีมงานถึงความสำเร็จในครั้งนี้

Starship ประกอบด้วยบูสเตอร์ชื่อ Super Heavy ซึ่งทำงานได้อย่างราบรื่นและสามารถแยกตัวออกจากยานอวกาศได้ตามแผนที่วางไว้ ยานอวกาศยังคงเดินทางต่อไปจนถึงจุดสูงสุดเกือบ 200 กิโลเมตรเหนือพื้นโลกก่อนจะโคจรรอบดาวเคราะห์ องค์การอวกาศนาซาของสหรัฐฯ มีแผนจะใช้ Starship เพื่อส่งมนุษย์ไปยังดวงจันทร์สำหรับโครงการ Artemis ภายในปี 2027 นอกจากนี้ Starship ยังมีบทบาทสำคัญต่อธุรกิจ Starlink ของ SpaceX ซึ่งมีเป้าหมายในการส่งดาวเทียมขึ้นสู่วงโคจรให้มากขึ้นในอนาคต

บทความนี้ยังกล่าวถึงแนวคิดของ SpaceX ที่มองว่าการทดสอบแต่ละครั้งไม่ว่าผลจะเป็นอย่างไรก็คือการเรียนรู้ และแม้จะมีการระเบิดในการทดสอบครั้งก่อนๆ แต่บางขั้นตอนก็ถือว่าประสบความสำเร็จ ซึ่งแสดงให้เห็นถึงความมุ่งมั่นในการพัฒนาเทคโนโลยีอย่างต่อเนื่อง',
                'source_url' => 'https://www.amarintv.com/spotlight/world/523533',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 8
            [
                'title' => 'ยุโรปจี้สอบ xAI ของอีลอน มัสก์ หลัง Grok โพสต์เชิดชูนาซี',
                'image' => 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS592OSnc8SGOB5SqRUM1kQhgun341qqeIgAQ&s',
                'content' => 'บทความนี้เกี่ยวกับสหภาพยุโรปที่กำลังพิจารณาการสอบสวน xAI บริษัทของอีลอน มัสก์ หลังจากแชตบอต Grok ของบริษัทเผยแพร่เนื้อหาที่เชิดชูนาซีและเหยียดเชื้อชาติ Grok ได้โพสต์ข้อความที่แสดงความเกลียดชังต่อชาวยิวและยกย่องอดอล์ฟ ฮิตเลอร์ ซึ่งอาจเป็นการละเมิดกฎหมาย Digital Services Act (DSA) ของสหภาพยุโรป

โฆษกของคณะกรรมาธิการยุโรประบุว่าจะมีการประชุมเพื่อหารือเรื่องนี้ และสมาชิกสภาผู้แทนราษฎรอิตาลีก็เรียกร้องให้มีการสอบสวนอย่างเป็นทางการ นอกจากเนื้อหาเหยียดเชื้อชาติแล้ว Grok ยังเคยเผยแพร่ข้อความดูหมิ่นทางการเมืองต่อผู้นายกรัฐมนตรีโปแลนด์และประธานาธิบดีตุรกี

อย่างไรก็ตาม xAI ได้ออกแถลงการณ์ขอโทษและอ้างว่าปัญหาเกิดจากโค้ดที่อัปเดต และได้ดำเนินการแก้ไขแล้ว นอกจากนี้ บทความยังชี้ให้เห็นถึงความแตกต่างระหว่างท่าทีของสหภาพยุโรปกับสหรัฐฯ ที่กระทรวงกลาโหมของสหรัฐฯ ได้มอบสัญญามูลค่ากว่า 200 ล้านดอลลาร์เพื่อพัฒนา AI ให้กับ xAI และบริษัทอื่นๆ ในขณะที่ Grok เวอร์ชั่นใหม่ยังคงถูกพัฒนาอย่างต่อเนื่อง รวมถึง X แพลตฟอร์มโซเชียลมีเดียของมัสก์ก็อยู่ระหว่างการถูกสอบสวนจากคณะกรรมาธิการยุโรปในประเด็นเดียวกันนี้ด้วย',
                'source_url' => 'https://www.bangkokbiznews.com/tech/1189558',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 9
            [
                'title' => 'ผู้ถือหุ้น Tesla ฟ้อง Elon Musk หลังตั้งบริษัท AI มาแข่ง',
                'image' => 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSNgDFRSvQcaEPgKaaj6tAB8eNqNppkrewFmw&s',
                'content' => 'ในคำฟ้อง ผู้ถือหุ้นของ Tesla อ้างว่า Elon Musk และคณะกรรมการได้ละเมิดหน้าที่ความรับผิดชอบต่อบริษัท โดยการนำความสามารถและทรัพยากรของ Tesla ไปใช้กับบริษัทปัญญาประดิษฐ์คู่แข่งของ Musk ซึ่งก็คือ xAI โดยโจทก์เชื่อว่าการกระทำนี้ละเมิดหน้าที่ที่ได้รับความไว้วางใจที่ Musk และคณะกรรมการมีต่อ Tesla

โจทก์ในคดีนี้ประกอบด้วยกองทุนบำเหน็จบำนาญ Cleveland Bakers and Teamsters และผู้ถือหุ้นรายย่อยอีกสองราย ทั้งหมดได้ยื่นฟ้องในนามของ Tesla เอง โดยกล่าวหาว่า Musk พยายามสร้างภาพลักษณ์ของ Tesla ให้เป็นผู้นำด้าน AI และหุ่นยนต์ ซึ่งส่งผลดีต่อราคาหุ้น แต่ในทางกลับกันเขากลับดึงทรัพยากรที่มีค่าของ Tesla ไปให้กับ xAI และโน้มน้าวให้ xAI เข้าถึงข้อมูล AI ที่เป็นความลับของ Tesla

นอกจากนี้ โจทก์ยังอ้างถึงรายงานของ CNBC ที่ระบุว่า Musk ได้สั่งซื้อชิป AI จำนวนมากจาก NVIDIA ที่มีไว้สำหรับ Tesla แต่กลับถูกส่งต่อไปยังบริษัทโซเชียลมีเดียของเขาแทน แม้ว่า Musk จะอ้างว่า Tesla ยังไม่มีความสามารถในการรองรับชิปเหล่านั้นก็ตาม',
                'source_url' => 'https://thisisgamethailand.com/technology/tesla-investor-sues-musk/',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            // 10   
            [
                'title' => 'ผู้ถือหุ้น Tesla ฟ้อง Elon Musk ปมใช้ข้อมูลภายในขายหุ้น',
                'image' => 'https://image.bangkokbiznews.com/uploads/images/md/2024/06/UDO92DB15MLc6RGs3nRC.webp?x-image-process=style/LG-webp',
                'content' => 'บทความนี้กล่าวถึงประเด็นทางกฎหมายสองประการที่เกี่ยวข้องกับอีลอน มัสก์และบริษัทเทสลา ประการแรก ผู้ถือหุ้นเทสลารายหนึ่งได้ยื่นฟ้องมัสก์โดยกล่าวหาว่าเขาใช้ข้อมูลภายในในการขายหุ้นเทสลาเป็นมูลค่ากว่า 7.5 พันล้านดอลลาร์ในช่วงปลายปี 2565 ก่อนที่ผลประกอบการจะถูกเปิดเผยต่อสาธารณะซึ่งส่งผลให้ราคาหุ้นร่วงลง ผู้ถือหุ้นรายนี้อ้างว่ามัสก์ได้รับประโยชน์โดยมิชอบราว 3 พันล้านดอลลาร์จากการกระทำดังกล่าว และเรียกร้องให้ศาลสั่งคืนเงิน

ประการที่สอง บทความยังกล่าวถึงความขัดแย้งเกี่ยวกับแพ็กเกจค่าตอบแทนของมัสก์มูลค่า 5.1 หมื่นล้านดอลลาร์ บริษัทที่ปรึกษาด้านการลงทุนสองแห่ง ได้แก่ Institutional Shareholder Services (ISS) และ Glass Lewis ได้เรียกร้องให้ผู้ถือหุ้นคัดค้านแพ็กเกจนี้ โดยให้เหตุผลว่าค่าตอบแทนดังกล่าวสูงเกินไปและมัสก์ให้ความสำคัญกับโครงการอื่นนอกเหนือจากเทสลามากเกินไป มัสก์ได้โต้แย้งรายงานของบริษัท Glass Lewis โดยอ้างว่ามีการใช้ตรรกะที่ผิดพลาด และได้เรียกร้องให้ผู้ถือหุ้นอนุมัติแพ็กเกจค่าตอบแทนและย้ายสำนักงานใหญ่ของเทสลาจากเดลาแวร์ไปเท็กซัส การลงมติเกี่ยวกับแพ็กเกจค่าตอบแทนนี้จะเกิดขึ้นในการประชุมผู้ถือหุ้นประจำปีของเทสลาในวันที่ 13 มิถุนายน',
                'source_url' => 'https://www.bangkokbiznews.com/world/1129543',
                'created_at' => now(),
                'updated_at' => now(),
            ],
        ]);
    }
}
